results/run-30vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 30 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 30 VUs  0m01.0s/1m0s

running (0m02.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 30 VUs  0m02.0s/1m0s

running (0m03.0s), 30/30 VUs, 10 complete and 0 interrupted iterations
default   [   5% ] 30 VUs  0m03.0s/1m0s

running (0m04.0s), 30/30 VUs, 40 complete and 0 interrupted iterations
default   [   7% ] 30 VUs  0m04.0s/1m0s

running (0m05.0s), 30/30 VUs, 61 complete and 0 interrupted iterations
default   [   8% ] 30 VUs  0m05.0s/1m0s

running (0m06.0s), 30/30 VUs, 79 complete and 0 interrupted iterations
default   [  10% ] 30 VUs  0m06.0s/1m0s

running (0m07.0s), 30/30 VUs, 100 complete and 0 interrupted iterations
default   [  12% ] 30 VUs  0m07.0s/1m0s

running (0m08.0s), 30/30 VUs, 130 complete and 0 interrupted iterations
default   [  13% ] 30 VUs  0m08.0s/1m0s

running (0m09.0s), 30/30 VUs, 151 complete and 0 interrupted iterations
default   [  15% ] 30 VUs  0m09.0s/1m0s

running (0m10.0s), 30/30 VUs, 171 complete and 0 interrupted iterations
default   [  17% ] 30 VUs  0m10.0s/1m0s

running (0m11.0s), 30/30 VUs, 199 complete and 0 interrupted iterations
default   [  18% ] 30 VUs  0m11.0s/1m0s

running (0m12.0s), 30/30 VUs, 220 complete and 0 interrupted iterations
default   [  20% ] 30 VUs  0m12.0s/1m0s

running (0m13.0s), 30/30 VUs, 241 complete and 0 interrupted iterations
default   [  22% ] 30 VUs  0m13.0s/1m0s

running (0m14.0s), 30/30 VUs, 261 complete and 0 interrupted iterations
default   [  23% ] 30 VUs  0m14.0s/1m0s

running (0m15.0s), 30/30 VUs, 289 complete and 0 interrupted iterations
default   [  25% ] 30 VUs  0m15.0s/1m0s

running (0m16.0s), 30/30 VUs, 310 complete and 0 interrupted iterations
default   [  27% ] 30 VUs  0m16.0s/1m0s

running (0m17.0s), 30/30 VUs, 331 complete and 0 interrupted iterations
default   [  28% ] 30 VUs  0m17.0s/1m0s

running (0m18.0s), 30/30 VUs, 351 complete and 0 interrupted iterations
default   [  30% ] 30 VUs  0m18.0s/1m0s

running (0m19.0s), 30/30 VUs, 379 complete and 0 interrupted iterations
default   [  32% ] 30 VUs  0m19.0s/1m0s

running (0m20.0s), 30/30 VUs, 400 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  0m20.0s/1m0s

running (0m21.0s), 30/30 VUs, 427 complete and 0 interrupted iterations
default   [  35% ] 30 VUs  0m21.0s/1m0s

running (0m22.0s), 30/30 VUs, 451 complete and 0 interrupted iterations
default   [  37% ] 30 VUs  0m22.0s/1m0s

running (0m23.0s), 30/30 VUs, 469 complete and 0 interrupted iterations
default   [  38% ] 30 VUs  0m23.0s/1m0s

running (0m24.0s), 30/30 VUs, 490 complete and 0 interrupted iterations
default   [  40% ] 30 VUs  0m24.0s/1m0s

running (0m25.0s), 30/30 VUs, 517 complete and 0 interrupted iterations
default   [  42% ] 30 VUs  0m25.0s/1m0s

running (0m26.0s), 30/30 VUs, 541 complete and 0 interrupted iterations
default   [  43% ] 30 VUs  0m26.0s/1m0s

running (0m27.0s), 30/30 VUs, 561 complete and 0 interrupted iterations
default   [  45% ] 30 VUs  0m27.0s/1m0s

running (0m28.0s), 30/30 VUs, 580 complete and 0 interrupted iterations
default   [  47% ] 30 VUs  0m28.0s/1m0s

running (0m29.0s), 30/30 VUs, 607 complete and 0 interrupted iterations
default   [  48% ] 30 VUs  0m29.0s/1m0s

running (0m30.0s), 30/30 VUs, 631 complete and 0 interrupted iterations
default   [  50% ] 30 VUs  0m30.0s/1m0s

running (0m31.0s), 30/30 VUs, 651 complete and 0 interrupted iterations
default   [  52% ] 30 VUs  0m31.0s/1m0s

running (0m32.0s), 30/30 VUs, 679 complete and 0 interrupted iterations
default   [  53% ] 30 VUs  0m32.0s/1m0s

running (0m33.0s), 30/30 VUs, 700 complete and 0 interrupted iterations
default   [  55% ] 30 VUs  0m33.0s/1m0s

running (0m34.0s), 30/30 VUs, 721 complete and 0 interrupted iterations
default   [  57% ] 30 VUs  0m34.0s/1m0s

running (0m35.0s), 30/30 VUs, 741 complete and 0 interrupted iterations
default   [  58% ] 30 VUs  0m35.0s/1m0s

running (0m36.0s), 30/30 VUs, 769 complete and 0 interrupted iterations
default   [  60% ] 30 VUs  0m36.0s/1m0s

running (0m37.0s), 30/30 VUs, 790 complete and 0 interrupted iterations
default   [  62% ] 30 VUs  0m37.0s/1m0s

running (0m38.0s), 30/30 VUs, 817 complete and 0 interrupted iterations
default   [  63% ] 30 VUs  0m38.0s/1m0s

running (0m39.0s), 30/30 VUs, 831 complete and 0 interrupted iterations
default   [  65% ] 30 VUs  0m39.0s/1m0s

running (0m40.0s), 30/30 VUs, 859 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  0m40.0s/1m0s

running (0m41.0s), 30/30 VUs, 880 complete and 0 interrupted iterations
default   [  68% ] 30 VUs  0m41.0s/1m0s

running (0m42.0s), 30/30 VUs, 907 complete and 0 interrupted iterations
default   [  70% ] 30 VUs  0m42.0s/1m0s

running (0m43.0s), 30/30 VUs, 930 complete and 0 interrupted iterations
default   [  72% ] 30 VUs  0m43.0s/1m0s

running (0m44.0s), 30/30 VUs, 949 complete and 0 interrupted iterations
default   [  73% ] 30 VUs  0m44.0s/1m0s

running (0m45.0s), 30/30 VUs, 970 complete and 0 interrupted iterations
default   [  75% ] 30 VUs  0m45.0s/1m0s

running (0m46.0s), 30/30 VUs, 997 complete and 0 interrupted iterations
default   [  77% ] 30 VUs  0m46.0s/1m0s

running (0m47.0s), 30/30 VUs, 1020 complete and 0 interrupted iterations
default   [  78% ] 30 VUs  0m47.0s/1m0s

running (0m48.0s), 30/30 VUs, 1041 complete and 0 interrupted iterations
default   [  80% ] 30 VUs  0m48.0s/1m0s

running (0m49.0s), 30/30 VUs, 1060 complete and 0 interrupted iterations
default   [  82% ] 30 VUs  0m49.0s/1m0s

running (0m50.0s), 30/30 VUs, 1087 complete and 0 interrupted iterations
default   [  83% ] 30 VUs  0m50.0s/1m0s

running (0m51.0s), 30/30 VUs, 1110 complete and 0 interrupted iterations
default   [  85% ] 30 VUs  0m51.0s/1m0s

running (0m52.0s), 30/30 VUs, 1131 complete and 0 interrupted iterations
default   [  87% ] 30 VUs  0m52.0s/1m0s

running (0m53.0s), 30/30 VUs, 1159 complete and 0 interrupted iterations
default   [  88% ] 30 VUs  0m53.0s/1m0s

running (0m54.0s), 30/30 VUs, 1180 complete and 0 interrupted iterations
default   [  90% ] 30 VUs  0m54.0s/1m0s

running (0m55.0s), 30/30 VUs, 1200 complete and 0 interrupted iterations
default   [  92% ] 30 VUs  0m55.0s/1m0s

running (0m56.0s), 30/30 VUs, 1221 complete and 0 interrupted iterations
default   [  93% ] 30 VUs  0m56.0s/1m0s

running (0m57.0s), 30/30 VUs, 1249 complete and 0 interrupted iterations
default   [  95% ] 30 VUs  0m57.0s/1m0s

running (0m58.0s), 30/30 VUs, 1270 complete and 0 interrupted iterations
default   [  97% ] 30 VUs  0m58.0s/1m0s

running (0m59.0s), 30/30 VUs, 1295 complete and 0 interrupted iterations
default   [  98% ] 30 VUs  0m59.0s/1m0s

running (1m00.0s), 30/30 VUs, 1311 complete and 0 interrupted iterations
default   [ 100% ] 30 VUs  1m00.0s/1m0s

running (1m01.0s), 03/30 VUs, 1338 complete and 0 interrupted iterations
default ↓ [ 100% ] 30 VUs  1m0s


  █ TOTAL RESULTS 

    checks_total.......: 1341    21.878234/s
    checks_succeeded...: 100.00% 1341 out of 1341
    checks_failed......: 0.00%   0 out of 1341

    ✓ status 200 байна

    HTTP
    http_req_duration..............: avg=156.64ms min=55.65ms med=221.37ms max=1.51s p(90)=233.43ms p(95)=235.2ms
      { expected_response:true }...: avg=156.64ms min=55.65ms med=221.37ms max=1.51s p(90)=233.43ms p(95)=235.2ms
    http_req_failed................: 0.00%  0 out of 2682
    http_reqs......................: 2682   43.756468/s

    EXECUTION
    iteration_duration.............: avg=1.35s    min=1.28s   med=1.32s    max=3.94s p(90)=1.33s    p(95)=1.33s  
    iterations.....................: 1341   21.878234/s
    vus............................: 3      min=3         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 5.1 MB 84 kB/s
    data_sent......................: 226 kB 3.7 kB/s



running (1m01.3s), 00/30 VUs, 1341 complete and 0 interrupted iterations
default ✓ [ 100% ] 30 VUs  1m0s